app/Controllers/AdoptadorController.php

    public function mostrar(){
        $alumnoModel = model('AdoptadorModel');
        $data['adoptadores']=$alumnoModel->findAll();
---
SELECT *
FROM `adoptador`

    public function buscar(){
        $adoptadorModel = model('AdoptadorModel');

        if(isset($_GET['nombre']) || isset($_GET['status']) || isset($_GET['CURP'])){
            $primerNombre = $_GET['nombre'];
            $segundoNombre = $_GET['nombre'];
            $apellidoPaterno = $_GET['nombre'];
            $apellidoMaterno = $_GET['nombre'];
            $CURP = $_GET['CURP'];
            $data['adoptadores']=$adoptadorModel->like('primerNombre',$primerNombre)
                            ->like('CURP',$CURP)
                            ->orlike('segundoNombre',$segundoNombre)
                            ->orlike('apellidoPaterno',$apellidoPaterno)
                            ->orlike('apellidoMaterno',$apellidoMaterno)
                            ->findAll();
---
SELECT *
FROM `adoptador`
WHERE `primerNombre` LIKE '%Miguel%' ESCAPE '!'
AND  `CURP` LIKE '%%' ESCAPE '!'
OR  `segundoNombre` LIKE '%Miguel%' ESCAPE '!'
OR  `apellidoPaterno` LIKE '%Miguel%' ESCAPE '!'
OR  `apellidoMaterno` LIKE '%Miguel%' ESCAPE '!'