app/Controllers/DietasController.php

SELECT *
FROM `dietas`
---
    public function mostrar(){
        $dietasModel = model('DietasModel');
        $data['dietas']=$dietasModel->findAll();

SELECT *
FROM `dietas`
WHERE `porcionesDiarias` LIKE '%%' ESCAPE '!'
AND  `tamañoPorción` LIKE '%200%' ESCAPE '!'
SELECT *
FROM `dietas`
---
    public function buscar(){
        $dietasModel = model('DietasModel');

        if(isset($_GET['porcionesDiarias']) || isset($_GET['tamañoPorción'])){
            $porcionesDiarias = $_GET['porcionesDiarias'];
            $tamañoPorción = $_GET['tamañoPorción'];
            $data['dietas']=$dietasModel->like('porcionesDiarias',$porcionesDiarias)
                            ->like('tamañoPorción',$tamañoPorción)
                            ->findAll();
        }
        else {
            $porcionesDiarias ="";
            $tamañoPorción="";
            $data['dietas']=$dietasModel->findAll();