app/Controllers/MascotasController.php

    public function mostrar(){
        $mascotasModel = model('MascotasModel');
        $data['mascotas']=$mascotasModel->findAll();

        $razasModel = model('RazasModel');
        $data['razas'] = $razasModel->findAll();

        $mascotaAdoptadorModel = model('mascotaAdoptadorModel');
        $data['adopciones'] = $mascotaAdoptadorModel->findAll();

        $alumnoModel = model('AdoptadorModel');
        $data['adoptadores']=$alumnoModel->findAll();
---
SELECT *
FROM `mascota`
WHERE `mascota`.`deleted_at` IS NULL
SELECT *
FROM `razas`
WHERE `razas`.`deleted_at` IS NULL
SELECT *
FROM `mascota_adoptador`
WHERE `mascota_adoptador`.`deleted_at` IS NULL
SELECT *
FROM `adoptador`
WHERE `adoptador`.`deleted_at` IS NULL

    public function agregar(){
        $razasModel = model('RazasModel');
        $data['razas'] = $razasModel->findAll();

        $dietasModel = model('DietasModel');
        $data['dietas'] = $dietasModel->findAll();

        $cuidadosModel = model('CuidadosModel');
        $data['cuidados'] = $cuidadosModel->findAll();
---
SELECT *
FROM `razas`
WHERE `razas`.`deleted_at` IS NULL
SELECT *
FROM `dietas`
WHERE `dietas`.`deleted_at` IS NULL
SELECT *
FROM `cuidados`
WHERE `cuidados`.`deleted_at` IS NULL

    public function insert(){
        $db = \Config\Database::connect();
        $resultado=$db->query('select * from mascota')->getResultArray();

        foreach ($resultado as $id){
            $valor = $id['idMascota'];
        }

        $mascotaCuidadosModel = model('mascotaCuidadosModel');
        $data2 = [
            "mascota"=>$valor,
            "cuidado"=>$_POST['idCuidados']
        ];
        $mascotaCuidadosModel->insert($data2);


        $mascotasModel = model('MascotasModel');

        $data = [
            "nombre"=>$_POST['nombre'],
            "edad"=>$_POST['edad'],
            "caracter"=>$_POST['caracter'],
            "raza"=>$_POST['idRaza'],
            "dieta"=>$_POST['idDietas'],
            "foto"=>$_POST['foto'],
        ];
        $mascotasModel->insert($data,false);
---
INSERT INTO `mascota_cuidados` (`mascota`, `cuidado`) VALUES ('69', '1')
INSERT INTO `mascota` (`nombre`, `edad`, `caracter`, `raza`, `dieta`, `foto`) VALUES ('ugouf', '51', 'kuyfy', '76', '14', 'https://cdn.pixabay.com/photo/2016/03/27/07/20/black-and-white-1282264_1280.jpg')

    public function buscar(){
        $mascotasModel = model('MascotasModel');

        $razasModel = model('RazasModel');
        $data['razas'] = $razasModel->findAll();

        $dietasModel = model('DietasModel');
        $data['dietas'] = $dietasModel->findAll();

        $cuidadosModel = model('CuidadosModel');
        $data['cuidados'] = $cuidadosModel->findAll();

        $mascotaAdoptadorModel = model('mascotaAdoptadorModel');
        $data['adopciones'] = $mascotaAdoptadorModel->findAll();

        $alumnoModel = model('AdoptadorModel');
        $data['adoptadores']=$alumnoModel->findAll();

        if(isset($_GET['nombre']) || isset($_GET['idRaza'])){
            $nombre = $_GET['nombre'];
            $idRaza = $_GET['idRaza'];

            $data['mascotas']=$mascotasModel->like('nombre',$nombre)
                            ->like('raza',$idRaza)
                            ->findAll();
        }
        else {
            $nombre ="";
            $idRaza="";
            $data['mascotas']=$mascotasModel->findAll();
---
SELECT *
FROM `razas`
WHERE `razas`.`deleted_at` IS NULL
SELECT *
FROM `dietas`
WHERE `dietas`.`deleted_at` IS NULL
SELECT *
FROM `cuidados`
WHERE `cuidados`.`deleted_at` IS NULL
SELECT *
FROM `mascota_adoptador`
WHERE `mascota_adoptador`.`deleted_at` IS NULL
SELECT *
FROM `adoptador`
WHERE `adoptador`.`deleted_at` IS NULL
SELECT *
FROM `mascota`
WHERE `mascota`.`deleted_at` IS NULL
SELECT *
FROM `razas`

    public function informacion($idMascota){
        $mascotasModel=model('MascotasModel');
        $data['mascota']=$mascotasModel->find($idMascota);

        $razasModel = model('RazasModel');
        $data['razas'] = $razasModel->findAll();

        $dietasModel = model('DietasModel');
        $data['dietas'] = $dietasModel->findAll();

        $cuidadosModel = model('CuidadosModel');
        $data['cuidados'] = $cuidadosModel->findAll();

        $mascotaCuidadosModel = model('mascotaCuidadosModel');
        $data['mascotaCuidados'] = $mascotaCuidadosModel->findAll();
---
SELECT *
FROM `mascota`
WHERE `mascota`.`deleted_at` IS NULL
AND `mascota`.`idMascota` = '12'
SELECT *
FROM `razas`
WHERE `razas`.`deleted_at` IS NULL
SELECT *
FROM `dietas`
WHERE `dietas`.`deleted_at` IS NULL
SELECT *
FROM `cuidados`
WHERE `cuidados`.`deleted_at` IS NULL
SELECT *
FROM `cuidados`
SELECT *
FROM `mascota_cuidados`
WHERE `mascota_cuidados`.`deleted_at` IS NULL

    public function adoptar($idMascota){
        $mascotasModel=model('MascotasModel');
        $data['mascota']=$mascotasModel->find($idMascota);

        $razasModel = model('RazasModel');
        $data['razas'] = $razasModel->findAll();

        $dietasModel = model('DietasModel');
        $data['dietas'] = $dietasModel->findAll();

        $cuidadosModel = model('CuidadosModel');
        $data['cuidados'] = $cuidadosModel->findAll();

        $mascotaCuidadosModel = model('mascotaCuidadosModel');
        $data['mascotaCuidados'] = $mascotaCuidadosModel->findAll();

        $alumnoModel = model('AdoptadorModel');
        $data['adoptadores']=$alumnoModel->findAll();
---
SELECT *
FROM `adoptador`