app/Controllers/UsuariosController.php

    public function index()
    {
        $mascotasModel = model('MascotasModel');
        $data['mascotas']=$mascotasModel->findAll();

        $razasModel = model('RazasModel');
        $data['razas'] = $razasModel->findAll();

        $mascotaAdoptadorModel = model('mascotaAdoptadorModel');
        $data['adopciones'] = $mascotaAdoptadorModel->findAll();

        $adoptadorModel = model('AdoptadorModel');
        $data['adoptadores']=$adoptadorModel->findAll();
---
SELECT *
FROM `mascota`
WHERE `mascota`.`deleted_at` IS NULL
SELECT *
FROM `razas`
WHERE `razas`.`deleted_at` IS NULL
SELECT *
FROM `mascota_adoptador`
WHERE `mascota_adoptador`.`deleted_at` IS NULL
SELECT *
FROM `adoptador`
WHERE `adoptador`.`deleted_at` IS NULL

    public function mascotas(){
        $mascotasModel = model('MascotasModel');

        $razasModel = model('RazasModel');
        $data['razas'] = $razasModel->findAll();

        $dietasModel = model('DietasModel');
        $data['dietas'] = $dietasModel->findAll();

        $cuidadosModel = model('CuidadosModel');
        $data['cuidados'] = $cuidadosModel->findAll();

        $mascotaAdoptadorModel = model('mascotaAdoptadorModel');
        $data['adopciones'] = $mascotaAdoptadorModel->findAll();

        $alumnoModel = model('AdoptadorModel');
        $data['adoptadores']=$alumnoModel->findAll();

        if(isset($_GET['idRaza'])){
            $idRaza = $_GET['idRaza'];

            $data['mascotas']=$mascotasModel->like('raza', $idRaza,$side='none')
                            ->findAll();
        }
        else {
            $idRaza="";
            $data['mascotas']=$mascotasModel->findAll();
---
SELECT *
FROM `razas`
WHERE `razas`.`deleted_at` IS NULL
SELECT *
FROM `dietas`
WHERE `dietas`.`deleted_at` IS NULL
SELECT *
FROM `cuidados`
WHERE `cuidados`.`deleted_at` IS NULL
SELECT *
FROM `mascota`
WHERE `raza` LIKE '7' ESCAPE '!'
SELECT *
FROM `mascota`
WHERE `mascota`.`deleted_at` IS NULL

    public function perros(){
        $mascotasModel = model('MascotasModel');

        $razasModel = model('RazasModel');
        $data['razas'] = $razasModel->findAll();

        $dietasModel = model('DietasModel');
        $data['dietas'] = $dietasModel->findAll();

        $cuidadosModel = model('CuidadosModel');
        $data['cuidados'] = $cuidadosModel->findAll();

        $mascotaAdoptadorModel = model('mascotaAdoptadorModel');
        $data['adopciones'] = $mascotaAdoptadorModel->findAll();

        $alumnoModel = model('AdoptadorModel');
        $data['adoptadores']=$alumnoModel->findAll();

        if(isset($_GET['idRaza'])){
            $idRaza = $_GET['idRaza'];

            $data['mascotas']=$mascotasModel->like('raza', $idRaza,$side='none')
                            ->findAll();
        }
        else {
            $idRaza="";
            $data['mascotas']=$mascotasModel->like('raza', 'Perro',$side='none')->findAll();
---
SELECT *
FROM `razas`
SELECT *
FROM `dietas`
SELECT *
FROM `cuidados`
SELECT *
FROM `mascota`
WHERE `raza` LIKE '14' ESCAPE '!'
SELECT *
FROM `mascota`
WHERE `raza` LIKE '73' ESCAPE '!'
AND `mascota`.`deleted_at` IS NULL
SELECT *
FROM `razas`
WHERE `razas`.`deleted_at` IS NULL

    public function gatos(){
        $mascotasModel = model('MascotasModel');

        $razasModel = model('RazasModel');
        $data['razas'] = $razasModel->findAll();

        $dietasModel = model('DietasModel');
        $data['dietas'] = $dietasModel->findAll();

        $cuidadosModel = model('CuidadosModel');
        $data['cuidados'] = $cuidadosModel->findAll();

        $mascotaAdoptadorModel = model('mascotaAdoptadorModel');
        $data['adopciones'] = $mascotaAdoptadorModel->findAll();

        $alumnoModel = model('AdoptadorModel');
        $data['adoptadores']=$alumnoModel->findAll();

        if(isset($_GET['idRaza'])){
            $idRaza = $_GET['idRaza'];

            $data['mascotas']=$mascotasModel->like('raza', $idRaza,$side='none')
                            ->findAll();
        }
        else {
            $idRaza="";
            $data['mascotas']=$mascotasModel->like('raza','Gato',$side='none')->findAll();
---
SELECT *
FROM `razas`
WHERE `razas`.`deleted_at` IS NULL
SELECT *
FROM `dietas`
WHERE `dietas`.`deleted_at` IS NULL
SELECT *
FROM `cuidados`
WHERE `cuidados`.`deleted_at` IS NULL
SELECT *
FROM `mascota_adoptador`
WHERE `mascota_adoptador`.`deleted_at` IS NULL
SELECT *
FROM `adoptador`
WHERE `adoptador`.`deleted_at` IS NULL
SELECT *
FROM `mascota`
WHERE `raza` LIKE '66' ESCAPE '!'
AND `mascota`.`deleted_at` IS NULL
SELECT *
FROM `mascota`
WHERE `raza` LIKE 'Gato' ESCAPE '!'
AND `mascota`.`deleted_at` IS NULL